Tekla Open API Reference for Tekla Structures 2025
ViewAttributes Constructor
Overload List
Name | Description
View.ViewAttributes()
 Creates a new view attributes instance that loads standard attributes.
View.ViewAttributes(String)
 Creates a new view attributes instance that loads the specified attributes.
Top
See Also
Reference
View.ViewAttributes Class
Tekla.Structures.Drawing Namespace